[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:44:14
                 <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
               </>
             )}
-            {hasRole(currentUser, "ROLE_ADMIN") && (
-              <Nav.Link as={Link} to="/moderate">
-                Moderate
-              </Nav.Link>
-            )}
+            {false}
           </Nav>
 
killedBy: AppNavbar tests renders the moderate link correctly
statusReason: Error: Unable to find an element with the text: Moderate. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:44:14
                 <Nav.Link href="/swagger-ui/index.html">Swagger</Nav.Link>
               </>
             )}
-            {hasRole(currentUser, "ROLE_ADMIN") && (
-              <Nav.Link as={Link} to="/moderate">
-                Moderate
-              </Nav.Link>
-            )}
+            {true}
           </Nav>
 
killedBy: AppNavbar tests renders the moderate link correctly
statusReason: Error: Unable to find an element with the text: Moderate. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
