[Killed] BlockStatement
main/pages/Dining/DiningCommonsIndexPage.js:4:50
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import { useParams } from "react-router-dom";
 
-export default function DiningCommonsIndexPage() {
-  // Stryker disable all : placeholder for future implementation
-  let { diningCommonsCode } = useParams();
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Placeholder for Dining Commons Page for {diningCommonsCode}</h1>
-        <p>This is a placeholder page that will be updated later.</p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function DiningCommonsIndexPage() {}
 
killedBy: DiningCommonsIndexPage tests Renders expected content
statusReason: Error: Unable to find an element with the text: Placeholder for Dining Commons Page for DLG. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
