[Killed] BooleanLiteral
main/components/MyReviews/MyReviewsTable.js:11:88
 } from "main/utils/MyReviewsUtils";
 import { useNavigate } from "react-router-dom";
 
-export default function MyReviewsTable({ reviews, moderatorOptions=false, deleteColumn=false }) {
+export default function MyReviewsTable({ reviews, moderatorOptions=false, deleteColumn=true }) {
   const navigate = useNavigate();
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user without delete
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-danger" data-testid="MyReviewsTable-cell-row-0-col-Delete-button" type="button">Delete</button> instead

[Killed] BooleanLiteral
main/components/MyReviews/MyReviewsTable.js:11:68
 } from "main/utils/MyReviewsUtils";
 import { useNavigate } from "react-router-dom";
 
-export default function MyReviewsTable({ reviews, moderatorOptions=false, deleteColumn=false }) {
+export default function MyReviewsTable({ reviews, moderatorOptions=true, deleteColumn=false }) {
   const navigate = useNavigate();
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user without delete
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-success" data-testid="MyReviewsTable-cell-row-0-col-Approve-button" type="button">Approve</button> instead

[Killed] BlockStatement
main/components/MyReviews/MyReviewsTable.js:14:34
 export default function MyReviewsTable({ reviews, moderatorOptions=false, deleteColumn=false }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/myreviews/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/myreviews/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
main/components/MyReviews/MyReviewsTable.js:49:5
       Header: "Stars",
       accessor: "stars",
     },
-    {
-      Header: "Review",
-      accessor: "review",
-    },
+    {},
     {
       Header: "Status",
killedBy: UserTable tests Has the expected column headers and content for ordinary user without delete
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/MyReviews/MyReviewsTable.js:50:15
       accessor: "stars",
     },
     {
-      Header: "Review",
+      Header: "",
       accessor: "review",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user without delete
statusReason: TestingLibraryElementError: Unable to find an element with the text: Review. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/MyReviews/MyReviewsTable.js:53:5
       Header: "Review",
       accessor: "review",
     },
-    {
-      Header: "Status",
-      accessor: "status",
-    },
+    {},
     {
       Header: "Moderator Comments",
killedBy: UserTable tests Has the expected column headers and content for ordinary user without delete
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/MyReviews/MyReviewsTable.js:58:15
       accessor: "status",
     },
     {
-      Header: "Moderator Comments",
+      Header: "",
       accessor: "moderatorComments",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user without delete
statusReason: TestingLibraryElementError: Unable to find an element with the text: Moderator Comments. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/MyReviews/MyReviewsTable.js:59:17
     },
     {
       Header: "Moderator Comments",
-      accessor: "moderatorComments",
+      accessor: "",
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user without delete
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MyReviewsTable-cell-row-0-col-moderatorComments"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/MyReviews/MyReviewsTable.js:66:23
   columns.push(
     ButtonColumn("Edit", "primary", editCallback, "MyReviewsTable"),
     );
-    if (deleteColumn) {
-        columns.push(
-        ButtonColumn("Delete", "danger", deleteCallback, "MyReviewsTable"),
-        );
-    }
+    if (deleteColumn) {}
     if (moderatorOptions) {
         columns.push( 
killedBy: UserTable tests Has the expected column headers and content for ordinary user with delete
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
main/components/MyReviews/MyReviewsTable.js:66:9
   columns.push(
     ButtonColumn("Edit", "primary", editCallback, "MyReviewsTable"),
     );
-    if (deleteColumn) {
+    if (false) {
         columns.push(
         ButtonColumn("Delete", "danger", deleteCallback, "MyReviewsTable"),
killedBy: UserTable tests Has the expected column headers and content for ordinary user with delete
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/components/MyReviews/MyReviewsTable.js:68:22
     );
     if (deleteColumn) {
         columns.push(
-        ButtonColumn("Delete", "danger", deleteCallback, "MyReviewsTable"),
+        ButtonColumn("", "danger", deleteCallback, "MyReviewsTable"),
         );
     }
killedBy: UserTable tests Has the expected column headers and content for ordinary user with delete
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ConditionalExpression
main/components/MyReviews/MyReviewsTable.js:71:9
         ButtonColumn("Delete", "danger", deleteCallback, "MyReviewsTable"),
         );
     }
-    if (moderatorOptions) {
+    if (true) {
         columns.push( 
             ButtonColumn("Approve", "success", editCallback, "MyReviewsTable"),
killedBy: UserTable tests Has the expected column headers and content for ordinary user without delete
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-success" data-testid="MyReviewsTable-cell-row-0-col-Approve-button" type="button">Approve</button> instead

[Killed] BlockStatement
main/components/MyReviews/MyReviewsTable.js:71:27
         ButtonColumn("Delete", "danger", deleteCallback, "MyReviewsTable"),
         );
     }
-    if (moderatorOptions) {
-        columns.push( 
-            ButtonColumn("Approve", "success", editCallback, "MyReviewsTable"),
-            ButtonColumn("Reject", "danger", editCallback, "MyReviewsTable"),
-        )
-    }
+    if (moderatorOptions) {}
 
   return (
killedBy: UserTable tests Has the expected column headers and content for moderator without delete
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/components/MyReviews/MyReviewsTable.js:73:26
     }
     if (moderatorOptions) {
         columns.push( 
-            ButtonColumn("Approve", "success", editCallback, "MyReviewsTable"),
+            ButtonColumn("", "success", editCallback, "MyReviewsTable"),
             ButtonColumn("Reject", "danger", editCallback, "MyReviewsTable"),
         )
killedBy: UserTable tests Has the expected column headers and content for moderator without delete
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/MyReviews/MyReviewsTable.js:73:62
     }
     if (moderatorOptions) {
         columns.push( 
-            ButtonColumn("Approve", "success", editCallback, "MyReviewsTable"),
+            ButtonColumn("Approve", "success", editCallback, ""),
             ButtonColumn("Reject", "danger", editCallback, "MyReviewsTable"),
         )
killedBy: UserTable tests Has the expected column headers and content for moderator without delete
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/components/MyReviews/MyReviewsTable.js:74:60
     if (moderatorOptions) {
         columns.push( 
             ButtonColumn("Approve", "success", editCallback, "MyReviewsTable"),
-            ButtonColumn("Reject", "danger", editCallback, "MyReviewsTable"),
+            ButtonColumn("Reject", "danger", editCallback, ""),
         )
     }
killedBy: UserTable tests Has the expected column headers and content for moderator without delete
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null
