[Killed] BlockStatement
src/main/utils/MyReviewsUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/myreviews",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
killedBy: UserTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/utils/MyReviewsUtils.js:11:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: "/api/myreviews",
-    method: "DELETE",
+    method: "",
     params: {
       id: cell.row.values.id,
killedBy: MyReviewsUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "method": "DELETE",
+   "method": "",
