[Killed] BooleanLiteral
main/components/MyReviews/MyReviewsTable.js:13:22
 
 export default function MyReviewsTable({
   reviews,
-  moderatorOptions = false,
+  moderatorOptions = true,
   deleteColumn = false,
 }) {
killedBy: UserTable tests Has the expected column headers and content for ordinary user without delete
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-success" data-testid="MyReviewsTable-cell-row-0-col-Approve-button" type="button">Approve</button> instead

[Killed] BooleanLiteral
main/components/MyReviews/MyReviewsTable.js:14:18
 export default function MyReviewsTable({
   reviews,
   moderatorOptions = false,
-  deleteColumn = false,
+  deleteColumn = true,
 }) {
   const navigate = useNavigate();
killedBy: UserTable tests Has the expected column headers and content for ordinary user without delete
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-danger" data-testid="MyReviewsTable-cell-row-0-col-Delete-button" type="button">Delete</button> instead

[Killed] ObjectLiteral
main/components/MyReviews/MyReviewsTable.js:41:5
       Header: "id",
       accessor: "id", // accessor is the "key" in the data
     },
-    {
-      Header: "Item",
-      accessor: "item",
-    },
+    {},
     {
       Header: "Station",
killedBy: UserTable tests Has the expected column headers and content for ordinary user without delete
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ConditionalExpression
main/components/MyReviews/MyReviewsTable.js:68:7
   ];
 
   columns.push(ButtonColumn("Edit", "primary", editCallback, "MyReviewsTable"));
-  if (deleteColumn) {
+  if (false) {
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, "MyReviewsTable"),
killedBy: UserTable tests Has the expected column headers and content for ordinary user with delete
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
main/components/MyReviews/MyReviewsTable.js:68:7
   ];
 
   columns.push(ButtonColumn("Edit", "primary", editCallback, "MyReviewsTable"));
-  if (deleteColumn) {
+  if (true) {
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, "MyReviewsTable"),
killedBy: UserTable tests Has the expected column headers and content for ordinary user without delete
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-danger" data-testid="MyReviewsTable-cell-row-0-col-Delete-button" type="button">Delete</button> instead

[Killed] ConditionalExpression
main/components/MyReviews/MyReviewsTable.js:73:7
       ButtonColumn("Delete", "danger", deleteCallback, "MyReviewsTable"),
     );
   }
-  if (moderatorOptions) {
+  if (false) {
     columns.push(
       ButtonColumn("Approve", "success", editCallback, "MyReviewsTable"),
killedBy: UserTable tests Has the expected column headers and content for moderator without delete
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/components/MyReviews/MyReviewsTable.js:75:31
   }
   if (moderatorOptions) {
     columns.push(
-      ButtonColumn("Approve", "success", editCallback, "MyReviewsTable"),
+      ButtonColumn("Approve", "", editCallback, "MyReviewsTable"),
       ButtonColumn("Reject", "danger", editCallback, "MyReviewsTable"),
     );
killedBy: UserTable tests Has the expected column headers and content for moderator without delete
statusReason: Error: expect(element).toHaveClass("btn-success")

Expected the element to have class:
  btn-success
Received:
  btn

[Killed] StringLiteral
main/components/MyReviews/MyReviewsTable.js:76:20
   if (moderatorOptions) {
     columns.push(
       ButtonColumn("Approve", "success", editCallback, "MyReviewsTable"),
-      ButtonColumn("Reject", "danger", editCallback, "MyReviewsTable"),
+      ButtonColumn("", "danger", editCallback, "MyReviewsTable"),
     );
   }
killedBy: UserTable tests Has the expected column headers and content for moderator without delete
statusReason: Error: A column ID (or string accessor) is required!
