[Killed] BlockStatement
src/main/pages/HomePage.js:5:36
 import DiningCommonsTable from "main/components/DiningCommons/DiningCommonsTable";
 import { useBackend } from "main/utils/useBackend";
 
-export default function HomePage() {
-  const {
-    data: fetchedDiningData,
-    error: _error,
-    status: _status,
-  } = useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    ["/api/diningcommons/all"],
-    { method: "GET", url: "/api/diningcommons/all" },
-    // Stryker disable next-line all : don't test default value of empty list
-    [],
-  );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Dining Commons</h1>
-        <DiningCommonsTable
-          diningCommonsData={fetchedDiningData}
-        ></DiningCommonsTable>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function HomePage() {}
 
killedBy: HomePage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="DiningCommonsTable-header-group-0"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ObjectLiteral
src/main/pages/HomePage.js:13:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/diningcommons/all"],
-    { method: "GET", url: "/api/diningcommons/all" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: HomePage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DiningCommonsTable-cell-row-0-col-code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/HomePage.js:13:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/diningcommons/all"],
-    { method: "GET", url: "/api/diningcommons/all" },
+    { method: "GET", url: "" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: HomePage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DiningCommonsTable-cell-row-0-col-code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
