[Killed] BlockStatement
main/components/DiningCommons/DiningCommonsTable.js:5:67
 import { Link } from "react-router-dom";
 import OurTable from "main/components/OurTable";
 
-export default function DiningCommonsTable({ diningCommonsData }) {
-  const columns = [
-    {
-      Header: "Code",
-      accessor: "code",
-      Cell: ({ value }) => <Link to={`/diningcommons/${value}`}>{value}</Link>,
-    },
-    {
-      Header: "Name",
-      accessor: "name",
-    },
-  ];
-
-  return (
-    <OurTable
-      data={diningCommonsData}
-      columns={columns}
-      testid={"DiningCommonsTable"}
-    />
-  );
-}
+export default function DiningCommonsTable({ diningCommonsData }) {}
 
killedBy: HomePage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="DiningCommonsTable-header-group-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/DiningCommons/DiningCommonsTable.js:7:5
 
 export default function DiningCommonsTable({ diningCommonsData }) {
   const columns = [
-    {
-      Header: "Code",
-      accessor: "code",
-      Cell: ({ value }) => <Link to={`/diningcommons/${value}`}>{value}</Link>,
-    },
+    {},
     {
       Header: "Name",
killedBy: HomePage tests tests where backend is working normally renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/DiningCommons/DiningCommonsTable.js:10:13
     {
       Header: "Code",
       accessor: "code",
-      Cell: ({ value }) => <Link to={`/diningcommons/${value}`}>{value}</Link>,
+      Cell: () => undefined,
     },
     {
killedBy: UserTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  carrillo
Received:
