[Killed] BlockStatement
main/components/DiningCommons/MealsTable.js:5:80
 import { Link } from "react-router-dom";
 import OurTable from "main/components/OurTable";
 
-export default function MealsTable({ mealsData, dateTime, diningCommonsCode }) {
-  const columns = [
-    {
-      Header: "Meal",
-      accessor: "name",
-      Cell: ({ value }) => (
-        <Link to={`/diningcommons/${dateTime}/${diningCommonsCode}/${value}`}>
-          {value}
-        </Link>
-      ),
-    },
-  ];
-
-  return <OurTable data={mealsData} columns={columns} testid={"MealsTable"} />;
-}
+export default function MealsTable({ mealsData, dateTime, diningCommonsCode }) {}
 
killedBy: MealsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Meal. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
main/components/DiningCommons/MealsTable.js:9:17
   const columns = [
     {
       Header: "Meal",
-      accessor: "name",
+      accessor: "",
       Cell: ({ value }) => (
         <Link to={`/diningcommons/${dateTime}/${diningCommonsCode}/${value}`}>
killedBy: MealsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MealsTable-cell-row-0-col-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/DiningCommons/MealsTable.js:10:13
     {
       Header: "Meal",
       accessor: "name",
-      Cell: ({ value }) => (
-        <Link to={`/diningcommons/${dateTime}/${diningCommonsCode}/${value}`}>
-          {value}
-        </Link>
-      ),
+      Cell: () => undefined,
     },
   ];
killedBy: MealsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Breakfast
Received:
