[Killed] BlockStatement
src/main/pages/MenuItemPage.js:4:40
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import { useParams } from "react-router-dom";
 
-export default function MenuItemPage() {
-  // Stryker disable all : placeholder for future implementation
-  let { dateTime } = useParams();
-  let { diningCommonsCode } = useParams();
-  let { meal } = useParams();
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Menu Item page not yet implemented for the following info</h1>
-        <>
-          {dateTime} / {diningCommonsCode} / {meal}
-        </>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function MenuItemPage() {}
 
killedBy: MenuItemPage tests Renders expected content
statusReason: Error: Unable to find an element with the text: Menu Item page not yet implemented for the following info. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
